xyfabc/Linux/F322/stm32/STM32F0x2_USB-FS-Device_Lib V1.0.0 (2)/Utilities/STM32_Audio/STM32072B_EVAL/stm32072b_audio_codec.c
/**
  ******************************************************************************
  * @file    stm32072b_audio_codec.c
  * @author  MCD Application Team
  * @version V1.0.0
  * @date    31-January-2014
  * @brief   This file includes the low layer driver for Audio Codec.
  * 
  *     *******************************************************************  
  *                           IMPORTANT NOTES
  *     *******************************************************************  
  *     This driver is intended for use ONLY in the scope of the current Audio 
  *     Example.
  *        
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2014 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32072b_audio_codec.h"
#ifdef __WAV_ADDON__
 #include "wavaddon.h"
#endif /* __WAV_ADDON__ */

/** @addtogroup STM32_Audio_Utilities
  * @{
  */


/** @defgroup STM32_AUDIO_CODEC 
  * @brief STM32 Audio Player module
  * @{
  */ 

/* Private typedef -----------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* This structure is declared global because it is handled by two different functions */
static DMA_InitTypeDef DMA_InitStructure; 
static uint32_t AudioFrequency = 0;
uint32_t AudioTotalSize = 0xFFFF; /* This variable holds the total size of the audio file */
uint32_t AudioRemSize   = 0xFFFF; /* This variable holds the remaining data in audio file */
uint16_t *CurrentPos;             /* This variable holds the current position of audio pointer */
uint32_t DataSize = 4;
  
/* Private function prototypes -----------------------------------------------*/ 
static uint32_t Audio_MAL_SetAudioConfig(uint8_t NumberOfChannels, uint8_t BitsPerSample);
void CODEC_DAC_IRQHandler(void);
/*------------------------------------------------------------------------------
                           Audio Codec functions 
------------------------------------------------------------------------------*/
/* Low layer codec functions */
static void     Codec_AudioInterface_DeInit(void);
static void     Codec_GPIO_Init(void);
static void     Codec_GPIO_DeInit(void);
static void     TRIGGER_FrequencyIncrement(void);
static void     TRIGGER_FrequencyDecrement(void);

/*----------------------------------------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
  
/**
  * @brief  Configure the audio peripherals.
  * @param  OutputDevice: OUTPUT_DEVICE_SPEAKER, OUTPUT_DEVICE_HEADPHONE,
  *                       OUTPUT_DEVICE_BOTH or OUTPUT_DEVICE_AUTO .
  * @param  Volume: Initial volume level (from 0 (Mute) to 100 (Max))
  * @param  AudioFreq: Audio frequency used to paly the audio stream.
  * @param  ExtClk: This parameter is not used.
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t EVAL_AUDIO_Init(uint16_t OutputDevice, uint8_t Volume, uint32_t AudioFreq, uint32_t Option)
{
  /* Perform low layer Codec initialization */
  if (Codec_Init(OutputDevice, Volume, AudioFreq) != 0)
  {
    return 1;
  }
  else
  {
    /* DMA data transfer preparation:
    Prepare the Media to be used for the audio transfer from memory to DAC peripheral */
    Audio_MAL_Init();
    
    /* Set audio parameters: mono/stereo, 8-bit/16-bit data. This function must
       be called after Audio_MAL_Init
       Option is coded as following:
        bit7 and bit 6 for number of channels
        bit5 to bit 0 for number of bits per sample */
    Audio_MAL_SetAudioConfig((uint8_t) (Option & 0xC0)>>6, (uint8_t) (Option & 0x3f));
    /* Return 0 when all operations are OK */
    return 0;
  }
}

/**
  * @brief Denitializes all the resources used by the codec (those initialized 
  *        by EVAL_AUDIO_Init() function). 
  * @param None.
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t EVAL_AUDIO_DeInit(void)
{ 
  /* DeInitialize the Media layer */
  Audio_MAL_DeInit();
  
  /* DeInitialize Codec */  
  Codec_DeInit();  
  
  return 0;
}

/**
  * @brief Starts playing audio stream from a data buffer for a determined size. 
  * @param pBuffer: Pointer to the buffer 
  * @param Size: Number of audio data BYTES.
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t EVAL_AUDIO_Play(uint16_t* pBuffer, uint32_t Size)
{
  /* Set the total number of data to be played (count in word) */
  AudioTotalSize = Size/DataSize;
  
  /* Update the Media layer and enable it for play */  
  Audio_MAL_Play((uint32_t)pBuffer, (uint32_t)(DMA_MAX(AudioTotalSize / DataSize)));
  
  /* Update the remaining number of data to be played */
  AudioRemSize = (Size/DataSize) - DMA_MAX(AudioTotalSize);
  
  /* Update the current audio pointer position */
  CurrentPos = pBuffer + DMA_MAX(AudioTotalSize);
  
  return 0;
}

/**
  * @brief This function Pauses or Resumes the audio file stream. 
  * @param Cmd: AUDIO_PAUSE (or 0) to pause, AUDIO_RESUME (or any value different
  *        from 0) to resume. 
  * @param Addr: Address from/at which the audio stream should resume/pause.
  * @param Size: Number of data to be configured for next resume.
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t EVAL_AUDIO_PauseResume(uint32_t Cmd, uint32_t Addr, uint32_t Size)
{    
  if (Cmd != AUDIO_PAUSE)
  {
    /* Call the Media layer pause/resume function */
    Audio_MAL_PauseResume(Cmd, Addr, Size);
    
    /* Call the Audio Codec Pause/Resume function */
    if (Codec_PauseResume(Cmd) != 0)
    {
      return 1;
    }
    else
    {
      return 0;
    }
  }
  else
  {
    /* Call the Media layer pause/resume function */
    Audio_MAL_PauseResume(Cmd, Addr, Size);
    
    /* Call the Audio Codec Pause/Resume function */
    if (Codec_PauseResume(Cmd) != 0)
    {
      return 1;
    }
    else
    {      
      /* Return 0 if all operations are OK */
      return 0;
    }
  }
}

/**
  * @brief Stops audio playing. 
  * @param Option: could be one of the following parameters 
  * @arg   CODEC_PDWN_SW for software power off (by writing registers) Then no 
  *        need to reconfigure the Codec after power on.
  * @arg   ODEC_PDWN_HW completely shut down the codec (physically). Then need 
  *        to reconfigure the Codec after power on.  
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t EVAL_AUDIO_Stop(uint32_t Option)
{
  /* Call Audio Codec Stop function */
  if (Codec_Stop(Option) != 0)
  {
    return 1;
  }
  else
  {
    /* Call Media layer Stop function */
    Audio_MAL_Stop();
    
    /* Update the remaining data number */
    AudioRemSize = AudioTotalSize;    
    
    /* Return 0 when all operations are correctly done */
    return 0;
  }
}

/**
  * @brief Controls the current audio volume level. 
  * @param Volume: Volume level to be set in percentage from 0% to 100% (0 for 
  *        Mute and 100 for Max volume level).
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t EVAL_AUDIO_VolumeCtl(uint8_t Volume)
{
#ifdef __WAV_ADDON__
  /* Call VolumeControl() from wavaddon.c */
  VolumeControl(Volume);
#endif /* __WAV_ADDON__ */
  return (0);
}

/**
  * @brief Enable or disable the MUTE mode by software 
  * @param Command: could be AUDIO_MUTE_ON to mute sound or AUDIO_MUTE_OFF to 
  *        unmute the codec and restore previous volume level.
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t EVAL_AUDIO_Mute(uint32_t Cmd)
{
  if(Cmd == AUDIO_MUTE_ON)
  {
#ifdef __WAV_ADDON__
    MuteControl(AUDIO_MUTE_ON);
#endif /* __WAV_ADDON__ */
  }
  else if(Cmd == AUDIO_MUTE_OFF)
  {
#ifdef __WAV_ADDON__
    MuteControl(AUDIO_MUTE_OFF);
#endif /* __WAV_ADDON__ */
  }
  else
  {
    return 1;
  }
  return (0);
}

/**
  * @brief  Manage the DMA transfer complete event.
  * @param  None
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t EVAL_AUDIO_XferCpltFlag(void)
{
  /* Clear DMA interrupt flags */
  if (DMA_GetFlagStatus(AUDIO_MAL_DMA_FLAG_TC) != RESET)
  {
    /* Clear the Interrupt flag */
    DMA_ClearFlag(AUDIO_MAL_DMA_FLAG_ALL);
    return 0;
  }
  return 1;
}

/*==============================================================================
                        Audio Codec Control Functions
==============================================================================*/
/**
* @brief Initializes the audio codec (DAC)
  * @param OutputDevice: can be OUTPUT_DEVICE_SPEAKER, OUTPUT_DEVICE_HEADPHONE,
  *                       OUTPUT_DEVICE_BOTH or OUTPUT_DEVICE_AUTO.
  * @param  Volume: Initial volume level (from 0 (Mute) to 100 (Max))
  * @param  AudioFreq: Audio frequency used to paly the audio stream.
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t Codec_Init(uint16_t OutputDevice, uint8_t Volume, uint32_t AudioFreq)
{
  /* Configure the Codec related IOs */
  Codec_GPIO_Init();
    
  /* Configure the DAC peripheral */
  Codec_AudioInterface_Init(AudioFreq);  
  
  /* Return communication control value */
  return 0;
}

/**
  * @brief Restore the audio codec state to default state and free all used 
  *        resources.
  * @param None.
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t Codec_DeInit(void)
{  
  /* Deinitialize all used GPIOs */
  Codec_GPIO_DeInit();
  
  /* Deinitialize the Codec audio interface (DAC) */
  Codec_AudioInterface_DeInit();
  
  /* Return communication control value */
  return 0;
}

/**
  * @brief Pauses and resumes playing on the audio codec.
  * @param Cmd: AUDIO_PAUSE (or 0) to pause, AUDIO_RESUME (or any value different
  *        from 0) to resume. 
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t Codec_PauseResume(uint32_t Cmd)
{
  uint32_t counter = 0;   
  
  /* Pause the audio file playing */
  if (Cmd == AUDIO_PAUSE)
  { 
    /* Disable TIM counter */
    TIM_Cmd(TRIGGER_TIM, DISABLE);     
  }
  else /* AUDIO_RESUME */
  {   
    /* Enable TIM counter */
    TIM_Cmd(TRIGGER_TIM, ENABLE);
  }

