xyfabc/Linux/F322/stm32/STM32F0x2_USB-FS-Device_Lib V1.0.0 (2)/Utilities/STM32_Audio/STM32072B_EVAL/stm32072b_audio_codec.c
  return counter;
}

/**
  * @brief Stops audio Codec playing
  * @param CodecPdwnMode: this parameter is with sense in STM32072B-EVAL.
  * @retval This function return always 0.
  */
uint32_t Codec_Stop(uint32_t CodecPdwnMode)
{
  /* Mute the output first */
  TIM_Cmd(TRIGGER_TIM, DISABLE);
  
  return 0;    
}

/**
* @brief  Switch audio digital streaming to new sampling rate
* @param  NewSamplingRate: Requested Sample rate in Hz.
* @retval 0 if correct communication, else wrong communication
*/
uint32_t EVAL_AUDIO_SwitchSamplingRate(uint32_t NewSamplingRate)
{
  RCC_ClocksTypeDef RCC_Clocks;
  
  /* Get misc clock frequencies: APB1 clock frequency is needed for timer configuration */
  RCC_GetClocksFreq(&RCC_Clocks);
  /* Set the timer period */
  TIM_SetAutoreload(TRIGGER_TIM, (RCC_Clocks.PCLK_Frequency / NewSamplingRate) - 1);
  return 0;
}

/**
  * @brief This function is not used in this codec but kept for compatibility.
  * @param None.
  * @retval This function always return 0.
  */
uint32_t Codec_SwitchOutput(uint8_t Output)
{  
  return 0;
}

/**
  * @brief  Initializes the Audio Codec audio interface (DAC)  
  * @param  AudioFreq: Audio frequency to be configured for the DAC peripheral. 
  * @retval None.
  */
void Codec_AudioInterface_Init(uint32_t AudioFreq)
{
  RCC_ClocksTypeDef RCC_Clocks;
  DAC_InitTypeDef DAC_InitStructure;
#if defined(AUDIO_MAL_DAC_IT_EN)
  NVIC_InitTypeDef NVIC_InitStructure;
#endif
  
  /* Get misc clock frequencies: APB1 clock frequency is needed for timer configuration */
  RCC_GetClocksFreq(&RCC_Clocks);
  /* Trigger timer clock enable */
  RCC_APB1PeriphClockCmd(TRIGGER_TIM_CLOCK, ENABLE);

  /*********************** TRIGGER TIM Configuration **************************/
  /* Reset TIM configuration */
  TIM_DeInit(TRIGGER_TIM);
  
  /* Save the audio frequency in global variable to be used later */
  AudioFrequency = AudioFreq;
  
  /* Set the timer period */
  TIM_SetAutoreload(TRIGGER_TIM, (RCC_Clocks.PCLK_Frequency / AudioFreq) - 1);
  
  /* TIM TRGO update selection */
  TIM_SelectOutputTrigger(TRIGGER_TIM, TIM_TRGOSource_Update);
  
  /*************************** DAC Configuration ******************************/  
  /* Enable the CODEC_DAC peripheral clock */
  RCC_APB1PeriphClockCmd(CODEC_DAC_CLK, ENABLE);
  
  /* Reset CODEC_DAC peripheral */
  DAC_DeInit();
  
  /* CODEC_DAC peripheral configuration */
  DAC_InitStructure.DAC_Trigger = DAC_Trigger_T6_TRGO;
  DAC_InitStructure.DAC_WaveGeneration = DAC_WaveGeneration_None;
  DAC_InitStructure.DAC_LFSRUnmask_TriangleAmplitude = DAC_LFSRUnmask_Bit0;
  DAC_InitStructure.DAC_OutputBuffer = DAC_OutputBuffer_Enable;
  DAC_Init(DAC_Channel_1, &DAC_InitStructure);
  
  /* Enable DAC Channel 1 */
  DAC_Cmd(DAC_Channel_1, ENABLE);
  
  /* Channel 2 configuration */
  DAC_Init(DAC_Channel_2, &DAC_InitStructure);
  
  /* Enable DAC Channel 2 */
  DAC_Cmd(DAC_Channel_2, ENABLE);
  
#if defined(AUDIO_MAL_DAC_IT_EN)
  
  /* Enable DMA underrun interrupt */
  DAC_ITConfig(DAC_Channel_1, DAC_IT_DMAUDR, ENABLE);
  
  /* DAC DMA IRQ Channel configuration */
  NVIC_InitStructure.NVIC_IRQChannel = CODEC_DAC_IRQ;
  NVIC_InitStructure.NVIC_IRQChannelPriority = EVAL_AUDIO_IRQ_PRIO;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
#endif
}

/**
  * @brief Restores the Audio Codec audio interface to its default state.
  * @param  None.
  * @retval None.
  */
static void Codec_AudioInterface_DeInit(void)
{
#if defined(AUDIO_MAL_DAC_IT_EN)
  NVIC_InitTypeDef NVIC_InitStructure;
#endif
  
  /* TRIGGER Timer de-initalization */
  /* Reset TIM configuration */
  TIM_DeInit(TRIGGER_TIM);
  /* Trigger timer clock enable */
  RCC_APB1PeriphClockCmd(TRIGGER_TIM_CLOCK, DISABLE);
  
  /* Disable the DAC peripheral (in case it hasn't already been disabled) */
  DAC_Cmd(DAC_Channel_1, DISABLE);
  
  /* in case of mono, only channel 1 is used and disabling channel2 is with no sense */
  DAC_Cmd(DAC_Channel_2, DISABLE);
  
  /* Deinitialize the DAC peripheral */
  DAC_DeInit();
  
  /* Disable the DAC peripheral clock */
  RCC_APB1PeriphClockCmd(CODEC_DAC_CLK, DISABLE);
  
#if defined(AUDIO_MAL_DAC_IT_EN)
  /* DAC DMA IRQ Channel configuration */
  NVIC_InitStructure.NVIC_IRQChannel = CODEC_DAC_IRQ;
  NVIC_InitStructure.NVIC_IRQChannelPriority = EVAL_AUDIO_IRQ_PRIO;
  NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
  NVIC_Init(&NVIC_InitStructure);
#endif
}

/**
  * @brief Initializes IOs used by the Audio Codec in analog mode.
  * @param  None.
  * @retval None.
  */
static void Codec_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;
  
  /* Enable DAC GPIO clocks */
  RCC_AHBPeriphClockCmd(CODEC_DAC_GPIO_CLOCK, ENABLE);
  
  /* CODEC_DAC Channel 1 and Channel 2 pins configuration in analog mode */
  GPIO_InitStructure.GPIO_Pin =  CODEC_DAC_CHANNEL1 | CODEC_DAC_CHANNEL2;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AN;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
}

/**
  * @brief Restores the IOs used by the Audio Codec interface to their default 
  *        state
  * @param  None.
  * @retval None.
  */
static void Codec_GPIO_DeInit(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;
  
  /* Deinitialize all the GPIOs used by the driver */
  GPIO_InitStructure.GPIO_Pin = CODEC_DAC_CHANNEL1 | CODEC_DAC_CHANNEL2;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_Level_2;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL;
  GPIO_Init(CODEC_DAC_GPIO, &GPIO_InitStructure);
}

#ifdef USE_DEFAULT_UNDERRUN_CALLBACK
/**
  * @brief  Basic management of the underrun situation.
  * @param  None.
  * @retval None.
  */
uint32_t Codec_UNDERRUN_UserCallback(void)
{
  /* Block communication and all processes */
  while (1)
  {
  }
}
#endif /* USE_DEFAULT_UNDERRUN_CALLBACK */

#ifdef AUDIO_MAL_DAC_IT_EN
/**
  * @brief  This function handles TIM6 and DAC interrupt request.
  * @param  None
  * @retval None
  */
void CODEC_DAC_IRQHandler(void)
{
#ifdef USE_DEFAULT_UNDERRUN_CALLBACK
  if(DAC_GetFlagStatus(DAC_Channel_1, DAC_FLAG_DMAUDR) != RESET)
  {
    Codec_UNDERRUN_UserCallback();
  }
#endif /* USE_DEFAULT_UNDERRUN_CALLBACK */
}
#endif /* AUDIO_MAL_DAC_IT_EN */

/*==============================================================================
                Audio MAL Interface Control Functions
==============================================================================*/

/**
  * @brief  Initializes and prepares the Media to perform audio data transfer 
  *         from Media to the DAC peripheral.
  * @param  None.
  * @retval None.
  */
void Audio_MAL_Init(void)
{
#if defined(AUDIO_MAL_DMA_IT_TC_EN) || defined(AUDIO_MAL_DMA_IT_HT_EN) || defined(AUDIO_MAL_DMA_IT_TE_EN)
  NVIC_InitTypeDef NVIC_InitStructure;
#endif
  
  /* Enable the DMA clock */
  RCC_AHBPeriphClockCmd(AUDIO_MAL_DMA_CLOCK, ENABLE);
  
  /* Configure the DMA channel */
  DMA_Cmd(AUDIO_MAL_DMA_CHANNEL, DISABLE);
  DMA_DeInit(AUDIO_MAL_DMA_CHANNEL);
  /* Set the parameters to be configured */
  /* By default 16-bit stereo is selected: this field can be updated using EVAL_AUDIO_SetAudioConfig() */
  DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)DAC_DHR12LD_ADDRESS;
  DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)0; /* This field will be configured in play function */
  DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralDST;
  DMA_InitStructure.DMA_BufferSize = (uint32_t)0xFFFE; /* This field will be configured in play function */
  DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
  DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
  DMA_InitStructure.DMA_PeripheralDataSize = AUDIO_MAL_DMA_PERIPH_DATA_SIZE;
  DMA_InitStructure.DMA_MemoryDataSize = AUDIO_MAL_DMA_MEM_DATA_SIZE;
  DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
  DMA_Init(AUDIO_MAL_DMA_CHANNEL, &DMA_InitStructure);

  /* Enable the selected DMA interrupts (selected in "stm32_eval_audio_codec.h" defines) */
#ifdef AUDIO_MAL_DMA_IT_TC_EN
  DMA_ITConfig(AUDIO_MAL_DMA_CHANNEL, DMA_IT_TC, ENABLE);
#endif /* AUDIO_MAL_DMA_IT_TC_EN */
#ifdef AUDIO_MAL_DMA_IT_HT_EN
  DMA_ITConfig(AUDIO_MAL_DMA_CHANNEL, DMA_IT_HT, ENABLE);
#endif /* AUDIO_MAL_DMA_IT_HT_EN */
#ifdef AUDIO_MAL_DMA_IT_TE_EN
  DMA_ITConfig(AUDIO_MAL_DMA_CHANNEL, DMA_IT_TE, ENABLE);
#endif /* AUDIO_MAL_DMA_IT_TE_EN */
  
