xyfabc/Linux/F322/stm32/STM32F0x2_USB-FS-Device_Lib V1.0.0 (2)/Utilities/STM32_Audio/STM32072B_EVAL/stm32072b_audio_codec.c
  /* Enable the DAC DMA request */
  DAC_DMACmd(DAC_Channel_1, ENABLE);
    
#if defined(AUDIO_MAL_DMA_IT_TC_EN) || defined(AUDIO_MAL_DMA_IT_HT_EN) || defined(AUDIO_MAL_DMA_IT_TE_EN)
  /* DAC DMA IRQ Channel configuration */
  NVIC_InitStructure.NVIC_IRQChannel = AUDIO_MAL_DMA_IRQ;
  NVIC_InitStructure.NVIC_IRQChannelPriority = EVAL_AUDIO_IRQ_PRIO;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
#endif 
}

/**
  * @brief  Restore default state of the used Media.
  * @param  None.
  * @retval None.
  */
void Audio_MAL_DeInit(void)  
{
#if defined(AUDIO_MAL_DMA_IT_TC_EN) || defined(AUDIO_MAL_DMA_IT_HT_EN) || defined(AUDIO_MAL_DMA_IT_TE_EN)
  NVIC_InitTypeDef NVIC_InitStructure;  
  
  /* Deinitialize the NVIC interrupt for the DAC DMA channel */
  NVIC_InitStructure.NVIC_IRQChannel = AUDIO_MAL_DMA_IRQ;
  NVIC_InitStructure.NVIC_IRQChannelPriority = EVAL_AUDIO_IRQ_PRIO;
  NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
  NVIC_Init(&NVIC_InitStructure);  
#endif 
  
  /* Configure the DMA channel */
  DMA_Cmd(AUDIO_MAL_DMA_CHANNEL, DISABLE);
  
  /* Dinitialize the DMA channel */
  DMA_DeInit(AUDIO_MAL_DMA_CHANNEL);

  /* The DMA clock is not disabled, since it can be used by other channels */
}

/**
  * @brief  Starts playing audio stream from the audio Media.
  * @param  Addr: Pointer to the audio stream buffer.
  *         It must be 16 bit-aligned in case of:
  *            1. mono channel and 16 bits per sample.
  *            1. stereo channels and 8 bits per sample.
  *         It must be 32 bit-aligned in case of stereo channels and 16 bits per sample.
  * @param  Size: Number of data in the audio stream buffer in half-word.
  * @retval None.
  */
void Audio_MAL_Play(uint32_t Addr, uint32_t Size)
{
#ifndef AUDIO_USE_MACROS 
  /* Disable the DAC DMA */
  DMA_Cmd(AUDIO_MAL_DMA_CHANNEL, DISABLE);

  /* Clear the Interrupt flag */
  DMA_ClearFlag(AUDIO_MAL_DMA_FLAG_TC); 
  
  /* Configure the buffer address and size */
  DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)Addr;
  /* Size is in half-word, multiply it by 2 to get the size in byte */
  DMA_InitStructure.DMA_BufferSize = (uint32_t)(Size*2/DataSize);

  /* Configure the DMA channel with the new parameters */
  DMA_Init(AUDIO_MAL_DMA_CHANNEL, &DMA_InitStructure);
  
  /* Enable the DAC DMA channel */
  DMA_Cmd(AUDIO_MAL_DMA_CHANNEL, ENABLE);

  /* If the DAC peripheral is still not enabled, enable it */
  if ((CODEC_DAC->CR & (DAC_CR_EN1 | DAC_CR_EN2)) == 0)
  {
    /* Enable DAC channel1 */
    DAC_Cmd(CODEC_DAC_CHANNEL1, ENABLE);
    /* Enable DAC channel2: in case of stereo */
    DAC_Cmd(CODEC_DAC_CHANNEL2, ENABLE);
  }
  
  /* Enable the trigger timer peripheral */
  TIM_Cmd(TRIGGER_TIM, ENABLE);
#else
  
  /* Disable the DAC DMA channel */
  AUDIO_MAL_DMA_CHANNEL->CCR &= ~(uint32_t)DMA_CCR_EN;
  
  /* Clear the Interrupt flag */
  AUDIO_MAL_DMA->AUDIO_MAL_DMA_IFCR = (uint32_t)(AUDIO_MAL_DMA_FLAG_TC);
  
  /* Wait the DMA channel to be effectively disabled */
  while ((AUDIO_MAL_DMA_CHANNEL->CCR & (uint32_t)DMA_CCR_EN) != 0)
  {}
 
  /* Configure the buffer address and size */
  AUDIO_MAL_DMA_CHANNEL->CMAR = (uint32_t)Addr;

  AUDIO_MAL_DMA_CHANNEL->CNDTR = (uint32_t)(Size*2/DataSize);
  
  /* Enable the DAC DMA channel */
  AUDIO_MAL_DMA_CHANNEL->CCR |= (uint32_t)DMA_CCR_EN;
  
  /* If the DAC peripheral is still not enabled, enable it.
     Channel 2 is enabled in case of stereo  */
  CODEC_DAC->CR |= (uint32_t)(DAC_CR_EN1 | DAC_CR_EN2);
  
  /* Enable Timer */
  TRIGGER_TIM->CR1 = TIM_CR1_CEN;
#endif /* AUDIO_USE_MACROS */
}

/**
  * @brief  Pauses or Resumes the audio stream playing from the Media.
  * @param Cmd: AUDIO_PAUSE (or 0) to pause, AUDIO_RESUME (or any value different
  *        from 0) to resume. 
  * @param Addr: Address from/at which the audio stream should resume/pause.
  * @param Size: Number of data to be configured for next resume.
  * @retval None.
  */
void Audio_MAL_PauseResume(uint32_t Cmd, uint32_t Addr, uint32_t Size)
{
  /* Pause the audio file playing */
  if (Cmd == AUDIO_PAUSE)
  {
    /* Pause the DAC DMA channel */
    DMA_Cmd(AUDIO_MAL_DMA_CHANNEL, DISABLE);
    
    /* Disable the DMA channel */
    DMA_Cmd(AUDIO_MAL_DMA_CHANNEL, DISABLE);
    
    /* Clear the Interrupt flag */
    DMA_ClearFlag(AUDIO_MAL_DMA_FLAG_ALL);  
  }
  else /* AUDIO_RESUME */
  {
    /* Disable DMA channel */
    DMA_Cmd(AUDIO_MAL_DMA_CHANNEL, DISABLE);
    
    /* Configure the buffer address and size */
    DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)Addr;
    DMA_InitStructure.DMA_BufferSize = (uint32_t)(Size*2/DataSize);
  
    /* Configure the DMA channel with the new parameters */
    DMA_Init(AUDIO_MAL_DMA_CHANNEL, &DMA_InitStructure);
    
    /* Resume the DAC DMA channel */
    DMA_Cmd(AUDIO_MAL_DMA_CHANNEL, ENABLE);
  }
}

/**
  * @brief  Stops audio stream playing on the used Media.
  * @param  None.
  * @retval None.
  */
void Audio_MAL_Stop(void)
{   
  /* Stop the Transfer on the DAC side: Stop and disable the DMA channel */
  DMA_Cmd(AUDIO_MAL_DMA_CHANNEL, DISABLE);

  /* Clear all the DMA flags for the next transfer */
  DMA_ClearFlag(AUDIO_MAL_DMA_FLAG_ALL);
  
  /* Wait the DMA channel to be effectively disabled */
  while ((AUDIO_MAL_DMA_CHANNEL->CCR & DMA_CCR_EN) == RESET)
  {}

  /* Stop the current DMA request by resetting the DAC cell */
  Codec_AudioInterface_DeInit();
  
  /* Re-configure the DAC interface for the next play operation */
  Codec_AudioInterface_Init(AudioFrequency);
}

/**
  * @brief  Configure the audio peripheral. The configuration parameters can be
  *         provided from the header of audio file.
  * @param  NumberOfChannels: number of channels: mono or stereo
  *         This parameter can be: 1 to select mono
  *                                2 to select stereo
  * @param  BitsPerSample: the number of effective data bits
  *         This parameter can be: 8 to select 8-bit data per sample
  *                                16 to select 16-bit data per sample
  * @retval 0 if correct configuration, otherwise wrong configuration
  */
static uint32_t Audio_MAL_SetAudioConfig(uint8_t NumberOfChannels, uint8_t BitsPerSample)
{
  /* Configure the DMA channel */
  DMA_Cmd(AUDIO_MAL_DMA_CHANNEL, DISABLE);
  /* Check if output type is mono and the bit depth is 8-bit */
  if((NumberOfChannels == 1) && (BitsPerSample == 8))
  {
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)DAC_DHR8R1_ADDRESS;
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
    DataSize = 1;/* data size is 1 byte (8-bit mono) */
  }
  /* Check if output type is stereo and the bit depth is 8-bit */
  else if((NumberOfChannels == 2) && (BitsPerSample == 8))
  {
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)DAC_DHR8RD_ADDRESS;
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
    DataSize = 2;/* data size is 2 bytes (16-bit stereo) */
  }
  /* Check if output type is mono and the bit depth is 16-bit */
  else if((NumberOfChannels == 1) && (BitsPerSample == 16))
  {
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)DAC_DHR12L1_ADDRESS;
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
    DataSize = 2;/* data size is 2 bytes (16-bit mono) */
  }
  /* Check if output type is stereo and the bit depth is 16-bit */
  else if((NumberOfChannels == 2) && (BitsPerSample == 16))
  {
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)DAC_DHR12LD_ADDRESS;
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Word;
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Word;
    DataSize = 4;/* data size is 4 bytes (16-bit stereo) */
  }
  else
  {
    /* wrong configuration */
    return 1;
  }
  
  /* Re-Init DMA */
  DMA_Init(AUDIO_MAL_DMA_CHANNEL, &DMA_InitStructure);
  /* Configure the DMA channel */
  DMA_Cmd(AUDIO_MAL_DMA_CHANNEL, ENABLE);
  /* correct configuration */
  return 0;
}

/**
  * @brief  Returns the remaining data count to be processed by MAL layer.
  * @param  None.
  * @retval Number of processed data.
  */
uint32_t Audio_MAL_GetRemCount(void)
{
  /* Return the remaining number of data */
  return (uint32_t)(DMA_GetCurrDataCounter(AUDIO_MAL_DMA_CHANNEL));
}

/*==============================================================================
                        Trigger Timer Functions
==============================================================================*/

/**
  * @brief  Trimm the current output frequency.
  * @param  Cycles: Number of clock cycles to be increased or decreased.
  *         The cycles are relative to the timer clock.
  * @retval 0 if correct configuration, else wrong configuration
  */
uint32_t EVAL_AUDIO_SamplingRateTrimm(int32_t Cycles)
{
  int32_t nbcycles = Cycles;
  
  if(nbcycles > 0)
  {
    while (nbcycles != 0)
    {
      TRIGGER_FrequencyIncrement();
      nbcycles--;
    }
  }
  else if(nbcycles < 0)
  {
    while (nbcycles != 0)
    {
      TRIGGER_FrequencyDecrement();
      nbcycles++;
    }
  }
  return 0;
}

/**
  * @brief Increment the timer frequency
  * @param none
  * @retval none
  */
static void TRIGGER_FrequencyIncrement(void)
{
  TRIGGER_TIM->ARR--;
}

/**
  * @brief Decrement the timer frequency
  * @param none
  * @retval none
  */
static void TRIGGER_FrequencyDecrement(void)
{
  TRIGGER_TIM->ARR++;
}

/**
  * @}
  */ 


/**
  * @}
  */ 
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
